Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.GetSortOrders
Get arrays of indexes of connected elements describing their order required by the type.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.AddSortOrder(System.Collections.Generic.IList{System.Int32})
Add array of indexes of connected elements describing their order required by the type.
It may contain 1 to N items (where N is the number of connected elements).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.GUID
GUID identifying the type.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.#ctor(System.Guid,System.Collections.Generic.IList{System.Collections.Generic.IList{System.Int32}})
Constructs a StructuralConnectionMatchType.
guid:
GUID identifying the type.
sortOrders:
Array of indexes of connected elements describing their order required by the type.
Each array may contain 1 to N items (where N is the number of connected elements).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.#ctor(System.Guid)
Constructs a StructuralConnectionMatchType with minimum required information (GUID).
guid:
GUID identifying the type.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionMatchType
Class containing the information about the type available for the Connection.
Remarks:
It's exposed in internal API.
Since:
2017